{
  "backend/main.mo": "Actor with access control managing user profiles and a lead system including creation, retrieval, status updates, and notes.",
  "feature_evidence.json": "Feature evidence record describing a contact configuration update and its associated files, components, and test metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries of numerous frontend files covering styling, marketing pages, CRM views, authentication, and React Query hooks.",
  "frontend/index.css": "Tailwind base stylesheet defining global OKLCH design tokens for light and dark themes.",
  "frontend/index.html": "Basic HTML entrypoint mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root component handling hash-based routing between marketing and CRM views and showing profile setup when needed.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with loading handling and query cache clearing.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog for first‑time users to submit profile details with validation and backend saving.",
  "frontend/src/components/crm/CRMLayout.tsx": "CRM dashboard layout with auth gating, header navigation, and wrapper for CRM pages.",
  "frontend/src/components/crm/LeadDetailPage.tsx": "Page for viewing a single lead, updating its status, and adding notes with loading and error states.",
  "frontend/src/components/crm/LeadsListPage.tsx": "Displays searchable and filterable table of all leads with status badges and error handling.",
  "frontend/src/components/layout/SiteFooter.tsx": "Marketing site footer with contact info, social links, services list, and service areas.",
  "frontend/src/components/layout/SiteHeader.tsx": "Responsive site header with navigation, contact links, CRM login button, and mobile menu.",
  "frontend/src/components/leads/LeadCaptureForm.tsx": "Lead submission form that validates fields, posts new leads, and shows success or error messages.",
  "frontend/src/components/leads/LeadCaptureSection.tsx": "Section wrapper that introduces and renders the lead capture form.",
  "frontend/src/components/marketing/HeroSection.tsx": "Hero banner with marketing content, feature list, imagery, and buttons leading to the quote form.",
  "frontend/src/components/marketing/MarketingPage.tsx": "Composes the main marketing page layout with header, hero, services, areas, testimonials, lead capture, and footer, passing navigation handlers to child components.",
  "frontend/src/components/marketing/ServiceAreasSection.tsx": "Displays service regions with highlighted locations and contact options using cards and layout components.",
  "frontend/src/components/marketing/ServicesSection.tsx": "Renders a grid of cleaning service offerings, each with icon, description, and feature list.",
  "frontend/src/components/marketing/TestimonialsSection.tsx": "Shows customer testimonials with ratings and details in a card grid layout.",
  "frontend/src/config/contact.ts": "Defines centralized contact info and helpers for generating tel: and mailto: links.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useAddLeadNote.ts": "Mutation hook to add a note to a lead and invalidate related lead queries.",
  "frontend/src/hooks/useCallerUserProfile.ts": "Fetches the current authenticated user’s profile once an actor and identity are available.",
  "frontend/src/hooks/useCreateLead.ts": "Mutation hook for creating leads and refreshing the leads list.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading, login, and identity management utilities.",
  "frontend/src/hooks/useLead.ts": "Queries a single lead by ID when the user is authenticated and the actor is ready.",
  "frontend/src/hooks/useLeads.ts": "Fetches all leads for authenticated users using the backend actor.",
  "frontend/src/hooks/useSaveCallerUserProfile.ts": "Mutation for saving the current user’s profile and invalidating its cache.",
  "frontend/src/hooks/useUpdateLeadStatus.ts": "Mutation to update a lead’s status and refresh both list and individual lead queries.",
  "frontend/src/index.css": "Defines Tailwind layers and a full light/dark theme using OKLCH CSS variables, and applies global base styles.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and the Internet Identity provider.",
  "frontend/src/utils/errorMessages.ts": "Converts backend or network errors into simple user-friendly English messages.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, storing, and clearing URL and sessionStorage parameters, supporting hash-based routing.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, animations, and OKLCH variable-driven theming.",
  "project_state.json": "Holds the project’s state, requirements, features, and known issues for the Clear Choice Solutions marketing site and CRM."
}